; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v2 ?v3)
             (pred_2 ?v7 ?v13)
             (pred_4 ?v2 ?v13)
             (pred_7 ?v1 ?v2 )
	     (pred_3 ?v2)
             (pred_11 ?v11)
             (pred_12 ?v7)
             (pred_8 ?v13)
             (pred_1 ?v2)
             (pred_9 ?v7)
             (pred_6 ?v2)
             (pred_10 ))



(:action op_5
:parameters (?v8 ?v10 ?v5 ?v4)
:precondition (and (pred_11 ?v8) (pred_11 ?v10) (pred_12 ?v5) (pred_8 ?v4)
          (pred_5 ?v8 ?v10) (pred_2 ?v5 ?v4)
                   (pred_4 ?v10 ?v4) (pred_3 ?v8) 
                   (pred_1 ?v10) (pred_9 ?v5))
:effect (and  (pred_6 ?v10) (not (pred_1 ?v10))))


(:action op_2
:parameters (?v8 ?v12)
:precondition (and (pred_11 ?v8) (pred_11 ?v12)
               (pred_3 ?v8) (pred_5 ?v8 ?v12) (pred_6 ?v12))
:effect (and (pred_3 ?v12) (not (pred_3 ?v8))))

(:action op_4
:parameters (?v8 ?v5)
:precondition (and (pred_11 ?v8) (pred_12 ?v5) 
                  (pred_3 ?v8) (pred_7 ?v5 ?v8) (pred_10 ))
:effect (and (pred_9 ?v5)
   (not (pred_7 ?v5 ?v8)) (not (pred_10 ))))


(:action op_1
:parameters (?v8 ?v9 ?v6)
:precondition (and (pred_11 ?v8) (pred_12 ?v9) (pred_12 ?v6)
                  (pred_3 ?v8) (pred_9 ?v6) (pred_7 ?v9 ?v8))
:effect (and (pred_9 ?v9) (pred_7 ?v6 ?v8)
        (not (pred_9 ?v6)) (not (pred_7 ?v9 ?v8))))

(:action op_3
:parameters (?v8 ?v5)
:precondition (and (pred_11 ?v8) (pred_12 ?v5) 
                  (pred_3 ?v8) (pred_9 ?v5))
:effect (and (pred_10 ) (pred_7 ?v5 ?v8) (not (pred_9 ?v5)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_15 obj_30 obj_13 obj_28 obj_07 obj_05 obj_08 obj_17 obj_14 obj_23 obj_21 obj_24 obj_11 obj_27 obj_09 obj_01 obj_06 obj_29 obj_10 obj_16 obj_31 obj_18 obj_26 obj_25 obj_22
    obj_03 obj_04 obj_12
    obj_19 obj_20 obj_02
    )

    (:init
       (pred_10)

       (pred_11 obj_15)
       (pred_11 obj_30)
       (pred_11 obj_13)
       (pred_11 obj_28)
       (pred_11 obj_07)
       (pred_11 obj_05)
       (pred_11 obj_08)
       (pred_11 obj_17)
       (pred_11 obj_14)
       (pred_11 obj_23)
       (pred_11 obj_21)
       (pred_11 obj_24)
       (pred_11 obj_11)
       (pred_11 obj_27)
       (pred_11 obj_09)
       (pred_11 obj_01)
       (pred_11 obj_06)
       (pred_11 obj_29)
       (pred_11 obj_10)
       (pred_11 obj_16)
       (pred_11 obj_31)
       (pred_11 obj_18)
       (pred_11 obj_26)
       (pred_11 obj_25)
       (pred_11 obj_22)
       (pred_8 obj_03)
       (pred_8 obj_04)
       (pred_8 obj_12)
       (pred_12 obj_19)
       (pred_12 obj_20)
       (pred_12 obj_02)

       (pred_5 obj_15 obj_05)
       (pred_5 obj_15 obj_30)
       (pred_5 obj_30 obj_08)
       (pred_5 obj_30 obj_13)
       (pred_5 obj_30 obj_15)
       (pred_5 obj_13 obj_17)
       (pred_5 obj_13 obj_28)
       (pred_5 obj_13 obj_30)
       (pred_5 obj_28 obj_14)
       (pred_5 obj_28 obj_07)
       (pred_5 obj_28 obj_13)
       (pred_5 obj_07 obj_23)
       (pred_5 obj_07 obj_28)
       (pred_5 obj_05 obj_21)
       (pred_5 obj_05 obj_08)
       (pred_5 obj_05 obj_15)
       (pred_5 obj_08 obj_24)
       (pred_5 obj_08 obj_17)
       (pred_5 obj_08 obj_30)
       (pred_5 obj_08 obj_05)
       (pred_5 obj_17 obj_11)
       (pred_5 obj_17 obj_14)
       (pred_5 obj_17 obj_13)
       (pred_5 obj_17 obj_08)
       (pred_5 obj_14 obj_27)
       (pred_5 obj_14 obj_23)
       (pred_5 obj_14 obj_28)
       (pred_5 obj_14 obj_17)
       (pred_5 obj_23 obj_09)
       (pred_5 obj_23 obj_07)
       (pred_5 obj_23 obj_14)
       (pred_5 obj_21 obj_01)
       (pred_5 obj_21 obj_24)
       (pred_5 obj_21 obj_05)
       (pred_5 obj_24 obj_06)
       (pred_5 obj_24 obj_11)
       (pred_5 obj_24 obj_08)
       (pred_5 obj_24 obj_21)
       (pred_5 obj_11 obj_29)
       (pred_5 obj_11 obj_27)
       (pred_5 obj_11 obj_17)
       (pred_5 obj_11 obj_24)
       (pred_5 obj_27 obj_10)
       (pred_5 obj_27 obj_09)
       (pred_5 obj_27 obj_14)
       (pred_5 obj_27 obj_11)
       (pred_5 obj_09 obj_16)
       (pred_5 obj_09 obj_23)
       (pred_5 obj_09 obj_27)
       (pred_5 obj_01 obj_31)
       (pred_5 obj_01 obj_06)
       (pred_5 obj_01 obj_21)
       (pred_5 obj_06 obj_18)
       (pred_5 obj_06 obj_29)
       (pred_5 obj_06 obj_24)
       (pred_5 obj_06 obj_01)
       (pred_5 obj_29 obj_26)
       (pred_5 obj_29 obj_10)
       (pred_5 obj_29 obj_11)
       (pred_5 obj_29 obj_06)
       (pred_5 obj_10 obj_25)
       (pred_5 obj_10 obj_16)
       (pred_5 obj_10 obj_27)
       (pred_5 obj_10 obj_29)
       (pred_5 obj_16 obj_22)
       (pred_5 obj_16 obj_09)
       (pred_5 obj_16 obj_10)
       (pred_5 obj_31 obj_18)
       (pred_5 obj_31 obj_01)
       (pred_5 obj_18 obj_26)
       (pred_5 obj_18 obj_06)
       (pred_5 obj_18 obj_31)
       (pred_5 obj_26 obj_25)
       (pred_5 obj_26 obj_29)
       (pred_5 obj_26 obj_18)
       (pred_5 obj_25 obj_22)
       (pred_5 obj_25 obj_10)
       (pred_5 obj_25 obj_26)
       (pred_5 obj_22 obj_16)
       (pred_5 obj_22 obj_25)
       (pred_1 obj_23)
       (pred_1 obj_14)
       (pred_1 obj_22)
       (pred_4  obj_23 obj_03)
       (pred_4  obj_14 obj_04)
       (pred_4  obj_22 obj_12)
       (pred_6 obj_15)
       (pred_6 obj_30)
       (pred_6 obj_13)
       (pred_6 obj_28)
       (pred_6 obj_07)
       (pred_6 obj_05)
       (pred_6 obj_08)
       (pred_6 obj_17)
       (pred_6 obj_21)
       (pred_6 obj_24)
       (pred_6 obj_11)
       (pred_6 obj_27)
       (pred_6 obj_09)
       (pred_6 obj_01)
       (pred_6 obj_06)
       (pred_6 obj_29)
       (pred_6 obj_10)
       (pred_6 obj_16)
       (pred_6 obj_31)
       (pred_6 obj_18)
       (pred_6 obj_26)
       (pred_6 obj_25)

       (pred_2  obj_19 obj_03)
       (pred_2  obj_20 obj_04)
       (pred_2  obj_02 obj_12)
       (pred_7 obj_19 obj_15)
       (pred_7 obj_20 obj_21)
       (pred_7 obj_02 obj_31)
       (pred_3 obj_09)
    )

    (:goal (and
       (pred_7 obj_20 obj_17)
       (pred_7 obj_02 obj_18)
    ))
(:constraints
  (always (not (pred_3 obj_06)))
)
)

; plan
1. (op_2 obj_09 obj_27)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_27)
   goals met: 0 of 2
2. (op_2 obj_27 obj_11)
   deleted: (pred_3 obj_27)
   added: (pred_3 obj_11)
   goals met: 0 of 2
3. (op_2 obj_11 obj_24)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_24)
   goals met: 0 of 2
4. (op_2 obj_24 obj_21)
   deleted: (pred_3 obj_24)
   added: (pred_3 obj_21)
   goals met: 0 of 2
5. (op_2 obj_21 obj_01)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_01)
   goals met: 0 of 2
6. (op_2 obj_01 obj_31)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_31)
   goals met: 0 of 2
7. (op_4 obj_31 obj_02)
   deleted: (pred_7 obj_02 obj_31) (pred_10)
   added: (pred_9 obj_02)
   goals met: 0 of 2
8. (op_2 obj_31 obj_18)
   deleted: (pred_3 obj_31)
   added: (pred_3 obj_18)
   goals met: 0 of 2
9. (op_3 obj_18 obj_02)
   deleted: (pred_9 obj_02)
   added: (pred_10) (pred_7 obj_02 obj_18)
   goals met: 1 of 2
10. (op_2 obj_18 obj_31)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_31)
   goals met: 1 of 2
11. (op_2 obj_31 obj_01)
   deleted: (pred_3 obj_31)
   added: (pred_3 obj_01)
   goals met: 1 of 2
12. (op_2 obj_01 obj_21)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_21)
   goals met: 1 of 2
13. (op_4 obj_21 obj_20)
   deleted: (pred_7 obj_20 obj_21) (pred_10)
   added: (pred_9 obj_20)
   goals met: 1 of 2
14. (op_2 obj_21 obj_05)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_05)
   goals met: 1 of 2
15. (op_2 obj_05 obj_08)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_08)
   goals met: 1 of 2
16. (op_2 obj_08 obj_17)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_17)
   goals met: 1 of 2
17. (op_3 obj_17 obj_20)
   deleted: (pred_9 obj_20)
   added: (pred_10) (pred_7 obj_20 obj_17)
   goals met: 2 of 2
